README.org
#+TITLE: Emacs Configuration File
#+STARTUP: content

* Introduction

A configuration file for Emacs. When tangled, it creates an early-init.el and an init.el file in the Emacs directory.

* Early Init file
:PROPERTIES:
:header-args: :tangle ~/.emacs.d/early-init.el
:END:

#+begin_src emacs-lisp
(tool-bar-mode   -1)
(menu-bar-mode   -1)
(scroll-bar-mode -1)
(tooltip-mode -1)

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t)

;; Ignore X resources
(advice-add #'x-apply-session-resources :override #'ignore)
#+end_src

* Init file
:PROPERTIES:
:header-args: :tangle ~/.emacs.d/init.el
:END:
** Initialize
*** Garbage Collecting

Increase threshold for garbage collection, and then restore to its initial value once we are done with the initiation process. This should speed up Emacs' start up time a bit.

#+begin_src emacs-lisp
(setq gc-cons-threshold 64000000)
(add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 800000)))
(setq load-prefer-newer t)
#+end_src

*** Straight + Use Package

#+begin_src emacs-lisp
(setq straight-check-for-modifications '(check-on-save))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; use-package integration
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)  ;; :straight t by default
(straight-use-package 'bind-key)          ;; enable :bind
(setq-default use-package-always-defer t) ;; lazy load all
#+end_src

*** System Dependent Variables

#+begin_src emacs-lisp
;; System
(defconst mar-on-mac (eq system-type 'darwin)
  "Working on a mac.")
(defconst mar-on-linux (eq system-type 'gnu/linux)
  "Working on a linux machine.")

(setq org-directory (if mar-on-mac "~/Dropbox/Org/" "~/Documents/Org/"))

(defvar mar-path-agenda (concat org-directory "agenda/")
  "Path to org agenda folder.")

(defvar mar-path-inbox (concat mar-path-agenda "inbox.org")
  "Path to default inbox file when doing org capture.")

(defvar mar-path-journal (concat mar-path-agenda "journal.org")
  "Path to journal/quick notes files used in org capture.")

(defvar mar-path-library (if mar-on-mac "~/Dropbox/lib/" "~/Documents/lib/")
  "Path to library directory.")

(defvar mar-path-library-cards `(,(concat mar-path-library "cards.bib"))
  "List of path to bibtex file with all the documents.")

(defvar mar-path-library-files `(,(concat mar-path-library "Pdf")
                                 ,(concat mar-path-library "Epub"))
  "List of paths to directories with all the documents.")

(defvar mar-path-llvm (if mar-on-mac "/usr/local/opt/llvm/bin/"
                        "/usr/local/llvm/bin/")
  "Path to llvm binaries.")

(defvar mar-path-clangd (concat mar-path-llvm "clangd")
  "Path to clangd.")

(defvar mar-path-clang-format (concat mar-path-llvm "clang-format")
  "Path to clang format.")

(defvar mar-default-python (if mar-on-mac "3.8.6" "3.8.6")
  "Default Python installation or environment.")

(defvar mar-path-python (if mar-on-mac "/Users/mrincon/.pyenv/versions/3.8.6/bin/"
                          "/usr/local/bin/")
  "Path to Python binaries.")

(defvar mar-path-python-lsp (concat mar-path-python "pyls")
  "Path to the language server for python.")

(defvar mar-path-python-black (concat mar-path-python "black")
  "Path to python's black.")

(defvar mar-path-secrets (concat user-emacs-directory "secrets.el")
  "Path to any non public local variables.")

(if (file-exists-p mar-path-secrets) (load mar-path-secrets))
#+end_src

** Defaults
*** Emacs

#+begin_src emacs-lisp
(setq custom-file (concat user-emacs-directory "custom.el"))
;; Default settings
(setq-default indent-tabs-mode nil
              inhibit-startup-screen t
              ring-bell-function 'ignore
              line-spacing 4
              initial-scratch-message "*scratch*\n"
              frame-resize-pixelwise t)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(blink-cursor-mode 0)
(fset 'yes-or-no-p 'y-or-n-p)
(show-paren-mode t)
;; Trancient Files
(setq auto-save-default nil
      make-backup-files nil)
#+end_src

*** Project

~Project.el~ is an Emacs core package; however, the one included in some distributions can be old and missing some functions, like ~project-root~ which is used by Eglot.  If the package that comes with Emacs is loaded instead of the one installed with straight, you need to remove it. You can use ~counsel-find-library~ (, s h) and open the file. Then use ~:(buffer-file-name)~ to find the location and delete it. Just make sure you don't remove the one inside the straight directory.

#+begin_src emacs-lisp
(use-package project)
#+end_src

*** Evil + Friends

#+begin_src emacs-lisp
(use-package evil
  :init
  (evil-mode +1)
  ;; Use esc to leave M-x buffers
  (defun minibuffer-keyboard-quit ()
    "Abort recursive edit."
    (interactive)
    (if (and delete-selection-mode transient-mark-mode mark-active)
        (setq deactivate-mark  t)
      (when (get-buffer "*Completions*") (delete-windows-on "*Completions*"))
      (abort-recursive-edit)))
  (define-key evil-normal-state-map [escape] 'keyboard-quit)
  (define-key evil-visual-state-map [escape] 'keyboard-quit)
  (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
  (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
  (global-set-key [escape] 'evil-exit-emacs-state)
  ;; leader key
  (define-prefix-command 'my-leader-map)
  (define-key evil-motion-state-map "," 'my-leader-map)
  ;; menu bindings
  (define-key my-leader-map "M" 'menu-bar-open)
  ;; toggle full frame
  (define-key my-leader-map "tf" 'toggle-frame-fullscreen)
  ;; windows bindings
  (define-key evil-motion-state-map (kbd "C-w f") 'make-frame)
  (define-key evil-motion-state-map (kbd "C-w h") 'evil-window-left)
  (define-key evil-motion-state-map (kbd "C-w j") 'evil-window-down)
  (define-key evil-motion-state-map (kbd "C-w k") 'evil-window-up)
  (define-key evil-motion-state-map (kbd "C-w l") 'evil-window-right)
  (define-key evil-motion-state-map (kbd "C-h") 'evil-window-left)
  (define-key evil-motion-state-map (kbd "C-j") 'evil-window-down)
  (define-key evil-motion-state-map (kbd "C-k") 'evil-window-up)
  (define-key evil-motion-state-map (kbd "C-l") 'evil-window-right)
  (define-key evil-motion-state-map (kbd "C-w _") 'window-swap-states)
  (define-key evil-motion-state-map (kbd "C-w ,") 'evil-window-decrease-width)
  (define-key evil-motion-state-map (kbd "C-w .") 'evil-window-increase-width)
  (define-key evil-motion-state-map (kbd "C-w d") 'evil-window-delete)
  ;; a minimal mode line
  (setq mar-mode-line-format
                '((:eval (propertize evil-mode-line-tag 'face '(:foreground "red")))
                  mode-line-modified              ;; modified
                  "R:"
                  mode-line-remote                ;; local/remote
                  "|"
                  (:eval (alist-get 'name (tab-bar--current-tab)))
                  "|"
                  mode-line-buffer-identification ;; buffer name, etc
                  mode-line-position
                  (vc-mode vc-mode)               ;; git info
                  "|"
                  mode-name
                  mode-line-misc-info))
  (setq evil-mode-line-format nil)
  (setq-default mode-line-position '("|%l:%c|"))
  (setq-default mode-line-format mar-mode-line-format)
  (setq mode-line-format mar-mode-line-format)
  ;; take care of cursors when in terminal mode
  (unless (display-graphic-p)
    (add-hook 'kill-emacs-hook (lambda () (send-string-to-terminal "\e[6 q")))
    (add-hook 'evil-insert-state-entry-hook
              (lambda () (send-string-to-terminal "\e[6 q")))
    (add-hook 'evil-normal-state-entry-hook
              (lambda () (send-string-to-terminal "\e[1 q")))))

(use-package undo-fu
  :init
  (define-key evil-normal-state-map "u" 'undo-fu-only-undo)
  (define-key evil-normal-state-map (kbd "C-r") 'undo-fu-only-redo))

(use-package ace-jump-mode
  :init
  (define-key my-leader-map "jw" 'evil-ace-jump-word-mode)
  (define-key my-leader-map "jl" 'evil-ace-jump-line-mode)
  (define-key my-leader-map "jc" 'evil-ace-jump-char-mode))

;; % to go to matching character
(use-package evil-matchit
  :init (global-evil-matchit-mode 1))

(use-package evil-mc
  :init
  (global-evil-mc-mode 1)
  (define-key my-leader-map "mi" 'evil-mc-make-cursor-in-visual-selection-beg)
  (define-key my-leader-map "ma" 'evil-mc-make-cursor-in-visual-selection-end)
  (define-key my-leader-map "mq" 'evil-mc-undo-all-cursors))

(use-package evil-nerd-commenter
  :init
  ;; toggle comments
  (define-key my-leader-map "tc" 'evilnc-comment-or-uncomment-lines)
  (define-key my-leader-map "tc" 'evilnc-comment-or-uncomment-lines))

(use-package sentence-navigation
  :init
  (define-key evil-motion-state-map ")" 'sentence-nav-evil-forward)
  (define-key evil-motion-state-map "(" 'sentence-nav-evil-backward)
  (define-key evil-motion-state-map "g)" 'sentence-nav-evil-forward-end)
  (define-key evil-motion-state-map "g(" 'sentence-nav-evil-backward-end)
  ;; e.g. das (outer) and dis (inner)
  (define-key evil-outer-text-objects-map "s" 'sentence-nav-evil-a-sentence)
  (define-key evil-inner-text-objects-map "s" 'sentence-nav-evil-inner-sentence))
#+end_src

*** Navigate buffers

#+begin_src emacs-lisp
(defun mar-close-this-buffer ()
  "Close the current buffer."
  (interactive)
  (kill-buffer (current-buffer)))

(defun mar-close-other-buffer ()
  "Close buffer in other window."
  (interactive)
  (unless (one-window-p)
    (other-window 1)
    (kill-this-buffer)
    (if (not (one-window-p))
        (other-window 1))))

(defun mar-close-and-kill-this-pane ()
  "Kill this window and its buffer."
  (interactive)
  (kill-buffer (current-buffer))
  (if (not (one-window-p))
      (delete-window)))

(defun mar-close-and-kill-other-pane ()
  "Kill other window and its buffer."
  (interactive)
  (other-window 1)
  (kill-this-buffer)
  (if (not (one-window-p))
      (delete-window)))

(defun mar-close-and-kill-this-file ()
  "Closes this buffer and delete the associated file."
  (interactive)
  (let ((file (buffer-file-name))
	(buffer (current-buffer)))
    (if file
	(when (yes-or-no-p (concat "Kill " file " ?"))
	  (delete-file file)
	  (kill-buffer buffer)
	  (message "Killed."))
      (error "This buffer is not a file."))))

(defun mar-cleanup-tramp-buffers ()
  "Close all tramp buffers and cleanup connections."
  (interactive)
  (tramp-cleanup-all-buffers)
  (tramp-cleanup-all-connections)
  (switch-to-buffer "*scratch*"))

(defun mar-cleanup-dired-buffers ()
  (interactive)
  "Closes all open dired buffers"
  (mapc (lambda (buffer)
          (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
            (kill-buffer buffer)))
        (buffer-list)))

(defun mar-switch-other-buffer ()
  "Switch to other buffer"
  (interactive)
  (switch-to-buffer (other-buffer)))

(defun mar-refresh-other-buffer ()
  "Refresh other buffer"
  (interactive)
  (unless (one-window-p)
    (other-window 1)
    (revert-buffer :ignore-auto :noconfirm)
    (other-window 1)))

(define-key my-leader-map "kb" 'mar-close-this-buffer)
(define-key my-leader-map "ko" 'mar-close-other-buffer)
(define-key my-leader-map "kB" 'mar-close-and-kill-this-pane)
(define-key my-leader-map "kO" 'mar-close-and-kill-other-pane)
(define-key my-leader-map "KK" 'mar-close-and-kill-this-file)
(define-key my-leader-map "kt" 'mar-cleanup-tramp-buffers)
(define-key my-leader-map "kd" 'mar-cleanup-dired-buffers)
(define-key my-leader-map "o"  'mar-switch-other-buffer)
(define-key my-leader-map "r"  'mar-refresh-other-buffer)
#+end_src

*** Ivy + Friends

You must load Counsel before ivy-prescient.el. This is because loading Counsel results in a number of changes being made to the user options of Ivy, which ivy-prescient.el must then undo.

*TIP:*
Wgrep allows you to edit all files in a grep result.
1) Use counsel-rg or counsel-git-grep to search all files in a project
2) Use C-c C-o to enter ivy-occur mode, followed by 'w' to make the grep results buffer editable
3) Then you can edit the results however you wish, and press C-x C-s to save or C-x C-k to abort.

#+begin_src emacs-lisp
(use-package counsel
  :init
  (counsel-mode 1)
  ;; extra functions
  (defun mar-rg-directory ()
    "rg (wgrep) in a directory"
    (interactive)
    (let* ((dir (read-file-name "Directory:" default-directory))
           (search ""))
      (counsel-rg search dir)))
  ;; help
  (define-key my-leader-map "hv" 'counsel-describe-variable)
  (define-key my-leader-map "hf" 'counsel-describe-function)
  (define-key my-leader-map "hl" 'counsel-find-library)
  (define-key my-leader-map "hu" 'counsel-unicode-char)
  (define-key my-leader-map "hb" 'counsel-descbinds)
  (define-key my-leader-map "ha" 'counsel-apropos)
  ;; search/switch
  (define-key my-leader-map "sm" 'counsel-mark-ring)
  (define-key my-leader-map "sB" 'counsel-bookmark)
  (define-key my-leader-map "sd" 'mar-rg-directory)
  (define-key my-leader-map "sg" 'counsel-git-grep)
  (define-key my-leader-map "sl" 'counsel-locate)
  (if mar-on-linux  (define-key my-leader-map "sa" 'counsel-linux-app))
  ;; kill ring
  (define-key my-leader-map "y" 'counsel-yank-pop)
  ;; find file (project is part of emacs)
  (evil-ex-define-cmd "ef" 'counsel-find-file)
  (evil-ex-define-cmd "er" 'counsel-recentf)
  (evil-ex-define-cmd "ep" 'project-find-file))

(use-package counsel-osx-app
  :if mar-on-mac
  :init
  (define-key my-leader-map "sa" 'counsel-osx-app))

(use-package ivy
  :init
  (ivy-mode 1)
  ;; add recent files and bookmars to switch buffer
  (setq ivy-use-virtual-buffers t)
  ;; shows total in the prompt
  (setq ivy-count-format "(%d/%d) ")
  ;; height of minibuffer
  (setq ivy-height 30)
  ;; minibuffer navigation
  (define-key ivy-minibuffer-map [escape] 'minibuffer-keyboard-quit)
  (define-key ivy-minibuffer-map (kbd "<right>") 'ivy-partial-or-done)
  ;; toggle search between regex plus and fuzzy, fuzzy gets more results
  (define-key my-leader-map "ts" 'ivy-toggle-fuzzy)
  ;; search/switch (project is part of emacs)
  (define-key my-leader-map "sb" 'ivy-switch-buffer)
  (define-key my-leader-map "ss" 'swiper-isearch)
  (define-key my-leader-map "sp" 'project-find-regexp)
  (define-key my-leader-map "sr" 'ivy-resume))

;; ivy plugins
(use-package ivy-prescient
  :requires (ivy)
  :init (ivy-prescient-mode 1))

(use-package ivy-rich
  :requires (ivy)
  :init
  (ivy-rich-mode 1)
  (setq ivy-rich-path-style 'abbrev))

;; Edit search results
(use-package wgrep)
#+end_src

